## Terraform Plan Output - sim - azuremonitor
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.AzureMonitor.azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dbdemo-sim-azmonitor-eastus-rg"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
    }

  # module.AzureMonitor.module.AzureMonitor.azurerm_eventhub.eh[0] will be created
  + resource "azurerm_eventhub" "eh" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "dbdemo-sim-azmonitor-eastus-evh"
      + namespace_name      = "dbdemo-sim-azmonitor-eastus-ehn"
      + partition_count     = 4
      + partition_ids       = (known after apply)
      + resource_group_name = "dbdemo-sim-azmonitor-eastus-rg"
      + status              = "Active"
    }

  # module.AzureMonitor.module.AzureMonitor.azurerm_eventhub_namespace.ehnamespace[0] will be created
  + resource "azurerm_eventhub_namespace" "ehnamespace" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 2
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "eastus"
      + maximum_throughput_units                  = (known after apply)
      + minimum_tls_version                       = (known after apply)
      + name                                      = "dbdemo-sim-azmonitor-eastus-ehn"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true
      + resource_group_name                       = "dbdemo-sim-azmonitor-eastus-rg"
      + sku                                       = "Basic"
      + tags                                      = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
      + zone_redundant                            = false
    }

  # module.AzureMonitor.module.AzureMonitor.azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "dbdemo-sim-azmonitor-eastus-log"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "dbdemo-sim-azmonitor-eastus-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
      + workspace_id                    = (known after apply)
    }

  # module.AzureMonitor.module.AzureMonitor.azurerm_storage_account.sa[0] will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = "Cool"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "dbdemo-sim-azmonitor-eastus-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
    }

  # module.AzureMonitor.module.AzureMonitor.random_integer.rng will be created
  + resource "random_integer" "rng" {
      + id     = (known after apply)
      + max    = 999
      + min    = 0
      + result = (known after apply)
    }

  # module.AzureMonitor.module.naming.random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.AzureMonitor.module.naming.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>